{
  "basics": {
    "name": "Robert James Gabriel",
    "label": "Software engineer",
    "picture": "http://robertgabriel.ninja/dist/img/me.png",
    "email": "robert_gabriel@outlook.com",
    "phone": "353851499082",
    "website": "http://robertgabriel.ninja/",
    "summary": "Robert Gabriel is a Software Engineer at Teamwork.com working with the Teamwork Projects team on importers for the product also leading the online and internal web sites team to 100% scalable and cutting edge. He is also develops/helps out on several open-source projects including Robin, Yettii, Xbox DVR Open Dyslexia (which has 60,000 uses) and upcoming Jarvis. Robert is also the author of several published papers including Problems Posed by Ad-blockers and Web Accessibility and OpenDyslexia. He's \"Gifted\" on both backend and frontend develop having won over 21 awards. Studied computer science at Cork Institute of Technology in Ireland and graduated at the top of my class.",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "",
      "countryCode": "",
      "region": ""
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "RobertJGabriel",
        "url": "https://twitter.com/RobertJGabriel"
      },
      {
        "network": "Github",
        "username": "RobertJGabriel",
        "url": "https://github.com/RobertJGabriel"
      },
      {
        "network": "linkedin",
        "username": "Robert James Gabriel",
        "url": "Public Profilehttps://ie.linkedin.com/in/robertjamesgabriel"
      }
    ]
  },
  "work": [
    {
      "company": "Teamwork.com",
      "position": "Teamwork.com Website Product lead & Sofware Engineer",
      "website": "https://www.teamwork.com",
      "startDate": "2017-12-01",
      "endDate": "",
      "summary": "Teamwork.com is an Irish, privately owned, developer-led web-based company based in Cork, Ireland. Teamwork.com creates task management and team collaboration software to support high-performance teams.",
      "highlights": [
        "Product and engineering lead for Teamwork.com's website. I lead and developed a rebuild of the stack. ",
        "Won serveral awards",
        "Optimized an algorithm that holds the current world record for Weisman Scores"
      ]
    },
    {
      "company": "Teamwork.com",
      "position": "Software Engineer",
      "website": "https://www.teamwork.com",
      "startDate": "05/23/2016",
      "endDate": "01/10/2017",
      "summary": "Software Engineer, primarily responsible for the development for the suite of importers the Teamwork.com Projects team used along with being dropped into other teams to help. These included a rebuild of the signup code, adding Google signup support and new features and UX changes. Responsibilities also included creating Coldfusion/Golang based server-side solutions, graphic design and SEO implementation.",
      "highlights": []
    },
    {
      "company": "Teamwork.com",
      "position": "Software Engineer (Part Time)",
      "website": "https://www.teamwork.com",
      "startDate": "09/1/2015",
      "endDate": "05/23/2016",
      "summary": "Worked part time while studying in 4th year of my college degree in computer science. Primarily responsible for the development for the suite of importers the Teamwork.com Projects team used along with developing new features and pages for Teamwork.com and the Cms that runs it. These included a rebuild of the signup code, adding Google signup support and new features and ux changes. Responsibilities also included creating Coldfusion/Golang based server-side solutions, Coffeescript based & javascript based server-side solutions, graphic design and SEO implementation.",
      "highlights": []
    },
    {
      "company": "Teamwork.com",
      "position": "Internship",
      "website": "https://www.teamwork.com",
      "startDate": "01/10/2015",
      "endDate": "09/12/2015",
      "summary": "While working at Teamwork as part of internship.  I worked in several parts of the company.  Working on the Teamwork Chat product fixing bugs and working in an agile team.  I also worked on developing the Teamwork Desk Docs. This was done with using Golang, Gulp and Swagger.  I also worked on developing/redesign the Teamwork.com website and cms written in Coldfusion, Coffeescript Html, Less along others.",
      "highlights": []
    },
    {
      "company": "Autism Start",
      "position": "Web Developer",
      "website": "https://autismstart.com",
      "startDate": "10/01/2013",
      "endDate": "06/10/2015",
      "summary": "Design and development of Autism Starts social website, includes access to original content, social network community and tools available for users. Users can utilise Autism Starts’ original content via video playback, articles, and tailored lesson plans. Supports interaction with other users through a deeply-embedded social networking system: users can follow others, receive status updates, upload photos and share links. Includes public discussion forums and the facility to add Items to a scrapbook to read later.",
      "highlights": []
    },
    {
      "company": "DeclanSinnott.com",
      "position": "Web Developer",
      "website": "DeclanSinnott.com",
      "startDate": "09/11/2013",
      "endDate": "02/3/2014",
      "summary": "Redesigning the online official website of well-renowned singer Declan Sinnott. As an internationally performing artist the objective was to grow online presence, support greater interaction with fans and centralize communication, cross-updating from Twitter, Facebook and his personal blog.",
      "highlights": []
    },
    {
      "company": "AllAroundCorkTaxiToursandTransfers.com",
      "position": "Web Developer",
      "website": "http://AllAroundCorkTaxiToursandTransfers.com",
      "startDate": "07/11/2013",
      "endDate": "04/01/2016",
      "summary": "Designed, developed and created the branding for AllAroundCorkTaxiToursandTransfers.com, a new taxi website in Cork. The site relies on social network and a huge database of locations which I also developed. Used Html5, knockout.js along others.",
      "highlights": []
    },
    {
      "company": "Learnlode",
      "position": "Software Developer",
      "website": "http://learnlode.com",
      "startDate": "09/21/2014",
      "endDate": "12/21/2014",
      "summary": "Designed a custom encryption algorithms to help with encrypting data for password restart in the enterprise market. Tied up patches of code along with reviewing code for development .",
      "highlights": []
    },
    {
      "company": "Clean Energy Ireland.ie",
      "position": "Web Developer",
      "website": "http://www.cleanenergyireland.ie/",
      "startDate": "05/01/2013",
      "endDate": "12/04/2014",
      "summary": "Design and development of an interactive website for Clean Energy Ireland. Building a redesigned website with more social features and better coding standards. Mobile site, improved SEO and updated server software along with a custom cms for the staff to use. Built in Php , backbone and html.",
      "highlights": []
    },
    {
      "company": "EMC/DELL",
      "position": "Software Developer (Internship)",
      "website": "https://www.emc.com",
      "startDate": "07/11/2013",
      "endDate": "09/21/2013",
      "summary": "Design and development of an interactive internal internet website for EMC employees. Employees interact with the website by creating an account, searching for employees and making mentor requests. Built using PHP, Html5, CSS and Microsoft Database.",
      "highlights": []
    },
    {
      "company": "EMC/DELL",
      "position": "Web Developer (Internship)",
      "website": "https://www.emc.com",
      "startDate": "08/01/2012",
      "endDate": "09/02/2012",
      "summary": "Throughout this internship gained experience in setting up networks and servers on a huge scale. Worked with a number of varied departments in areas such as Networking, Coding, Engineering and HR. Redesigned and built the Visitors Portal Website to improve information and interactivity through social sharing and videos.",
      "highlights": []
    },
    {
      "company": "Microsoft",
      "position": "Web Developer (Internship)",
      "website": "https://www.microsoft.com",
      "startDate": "02/01/2011",
      "endDate": "03/02/2011",
      "summary": "Participation in the national Young Scientist competition resulted in an invitation to this Microsoft Internship Workshop where there was a focus on developing critical links in the innovation process, commercialisation of skills, professional and career development skills along with software development skills.",
      "highlights": []
    },
    {
      "company": "HORNER APG",
      "position": "Test Engineer (Internship)",
      "website": "http://www.heapg.com/",
      "startDate": "07/01/2010",
      "endDate": "09/01/2010",
      "summary": "Building circuit boards for Horner APG projects and coding on pre-market test projects & experience in R&D.",
      "highlights": []
    },
    {
      "company": "robertgabriel.ninja",
      "position": "Independent Software Developer",
      "website": "https://robertgabriel.ninja",
      "startDate": "01/01/2009",
      "endDate": "10/09/2016",
      "summary": "As a developer at Projectbird, This is my website where I build tools and software for the open source community. I also build software to enter competitions and host the software and websites I have built for people.",
      "highlights": [
        ""
      ]
    }
  ],
  "volunteer": [],
  "education": [
    {
      "institution": "Cork Institute of Technology",
      "area": "Computer Science",
      "studyType": "Bachelor",
      "startDate": "2012-09-01",
      "endDate": "2016-10-01",
      "gpa": "4.0",
      "courses": []
    },
    {
      "institution": "",
      "area": "",
      "studyType": "",
      "startDate": "",
      "endDate": "",
      "gpa": "",
      "courses": []
    }
  ],
  "awards": [
    {
      "title": "Best use of Open Source Tools",
      "date": "2016-05-01",
      "awarder": "IBM & Intel",
      "summary": "Awarded for my use into machine learning alogorthims and cutting edge tools, such as node.js, Material design along more. Best project in college"
    },
    {
      "title": "Overall Best Poster & Project 2016",
      "date": "2016-05-01",
      "awarder": "Cork Institute of Technology",
      "summary": "Awarded for my use into machine learning alogorthims and cutting edge tools, such as node.js, Material design along more."
    },
    {
      "title": "Imagine Cup National Runner Up",
      "date": "2015-01-01",
      "awarder": "Microsoft Ireland",
      "summary": "Following on from our success in 2014, I entered the Imagine Cup 2015 with a innovative exercise app called CrossTrainr. The application was designed to connect individuals with a desire to exercise but found it hard to find people with a similar interest. Designed for use in large cities, it was designed to create a network of people for completing exercise. We received great feedback and support from Microsoft employees and management on the concept at a visit to Microsoft's offices in Dublin on the 23rd of April 2015. The Microsoft employees encouraged us to pursue the idea after the competition to a fully functional business. Until I have exhausted all avenues with the concept I am reluctant to give any more information on the idea."
    },
    {
      "title": "Imagine Cup National Runner Up",
      "date": "2014-01-01",
      "awarder": "Microsoft Ireland",
      "summary": "Developed a project called Yeti for the Microsoft Imagine Cup 2014. The project earned 2nd place in the innovation category for all of Ireland. The project resized images and videos to reduce bandwidth and speed up load times. Also developed was Yoursear.ch"
    },
    {
      "title": "Hatchery Scholarship For Innovation",
      "date": "2013-06-11",
      "awarder": "Cork Institute of Technology",
      "summary": "Over the summer months in 2012 five student projects were developed into businesses by students who attended the Rubicon full-time. Over the summer they attended weekly training workshops, covering many topics, which enabled the student entrepreneurs to produce a completed business plan by September. The students received financial assistance from the School of Business, the School of Engineering and Science, the Department of Media Communications and from Crawford College of Art and Design."
    },
    {
      "title": "Abbott Runner-Up Award",
      "date": "2011-04-12",
      "awarder": "Abbott",
      "summary": "I totally forgot about this. For a local computation called Scifest , I built a tablet out of an old laptop. Added a touch screen panel, progammed a interface and bunch of apps for it. Then made a custom shell for it. It was madness but I can second place. Won the Abbott award."
    },
    {
      "title": "Imagine Cup innovation National Runner Up",
      "date": "2014-05-19",
      "awarder": "Microsoft Ireland",
      "summary": "Was involved in the development of a project called Falcon for the Microsoft Imagine Cup 2014. The project earned us 2nd place in the innovation category. Our project resized images and videos to reduce bandwidth and speed up load times."
    },
    {
      "title": "The Most Technically Innovative Award",
      "date": "2013-05-12",
      "awarder": "Cork Institute of Technology",
      "summary": "The Most Technically Innovative Award of €2,000 went to Project Bird, an award winning software studio focusing on windows and web 2.0 developments. The team is made up Robert Gabriel and Tadhg Foley, both students in Computing (IT Management), at CIT."
    },
    {
      "title": "Second Place Maths and Algorthims",
      "date": "2012-01-21",
      "awarder": "Bt Young Scientist",
      "summary": "Robert Gabriel from Scoil Mhuire Gan Smal in Blarney, who came second in the Chemical, Physical & Mathematical Sciences Senior Individual category for his project ' A new algorithm to improve the gathering of information on mobile. This later become the Yeti engine"
    },
    {
      "title": "Bt Young Scientist Award : Technologys",
      "date": "2010-01-21",
      "awarder": "Bt Young Scientist",
      "summary": "Robert Gabriel, a fifth year student from Scoil Mhuire gan Smál in Blarney, won the favour of the judges with his project “Automated Monitoring of Computer SQL Servers by way of a Merit”. This later became Tallus"
    },
    {
      "title": "Sci Fest Award : For Progamming x 5",
      "date": "",
      "awarder": "Sci-fest",
      "summary": "SciFest is a series of one-day science fairs for second-level students hosted at local level in schools and at regional level in the Institutes of Technology, culminating in a national competition for the overall winners from the institutes. The project consists of four distinct strands – local, regional, national and international. This was a project that was made in 24 hours."
    },
    {
      "title": "HEANet Special Award",
      "date": "2012-03-21",
      "awarder": "HEANet",
      "summary": "The project which shows the most practical and innovative use of network technology in performing background research for the project and/or collaborating with other team members, teachers etc."
    },
    {
      "title": "Avaya Communications Special Award",
      "date": "2011-03-29",
      "awarder": "Avaya",
      "summary": "Avaya Incis a privately held global provider of business communications and collaboration systems. The international headquarters is in Basking Ridge, New Jersey, United States. The company provides contact centers, networking (routers, switches and other networking hardware), unified communications, and video products (integrated hardware and software) solutions and services."
    },
    {
      "title": "Spiders Awards: All Ireland TItle",
      "date": "",
      "awarder": "Eircom",
      "summary": "A web application that is fully developed and available to use; it must be fully working. It should be user friendly, useful and innovative."
    },
    {
      "title": "Spider Awards: Best Application",
      "date": "",
      "awarder": "Eircom",
      "summary": "A web application that is fully developed and available to use; it must be fully working. It should be user friendly, useful and innovative."
    },
    {
      "title": "Teamwork Hackathon 2015 : Runner Up",
      "date": "2015/03/11",
      "awarder": "Teamwork.com",
      "summary": "Create a internal website , social website in 24 hours. It was voted as second best would of 15 ideas. Cannot say any more :)"
    },
    {
      "title": "Everyday Excellence Award",
      "date": "",
      "awarder": "Teamwork.com",
      "summary": "Reason:We’re delighted to have Robert as a full-time member of the team now. He’s already made great improvements to the teamwork.com codebase, with loads more planned, a lot of it being behind-the-scenes improvements which most people don’t see/realise. Reason:Doing amazing job and I was impressed to see what awesomeness he is cooking for the website and maybe a future update of it. Nice to have him on board!"
    },
    {
      "title": "Above and Beyond the Call of Duty",
      "date": "",
      "awarder": "Teamwork.com",
      "summary": "Reason: Robert Gabriel – A pure gent, always has a smile and always goes out of his way to help Support when ticket is beyond us. Thanks Robert!"
    },
    {
      "title": "The Faculty of Engineering & Science Scholar",
      "date": "2016-09-11",
      "awarder": "Cork Institute of Technology",
      "summary": "Who received the accolade 'Faculty Scholar' in recognition of his achievement of earning the top grade in his class."
    },
    {
      "title": "Above and Beyond the Call of Duty Award",
      "date": "2016-12-03",
      "awarder": "Teamwork",
      "summary": "Robert always works at the standard of going above and beyond the call of duty. His recent SEO audit was just another example of the great work Robert does. He looks beyond what’s asked of him and takes a thorough approach to ensuring everything the company presents is the best it can be."
    },
    {
      "title": "Everyday Excellence Award ",
      "date": "2016-12-30",
      "awarder": "Teamwork.com",
      "summary": "Rob is always coming up with and implementing new ideas to propel the business. I can’t count the number of times he’s told me “we can do anything.” He works hard and always goes the extra mile."
    },
    {
      "title": "Everyday Excellence Award ",
      "date": "2016-12-30",
      "awarder": "Teamwork.com",
      "summary": "Teamwork.com’s SEO had needed some TLC for so long and Robert James stepped up to the challenge in no small way! The amount of research and work he’s put in so far has already made a huge difference in how we rank and display in Google, and is key to our acquisition work in marketing. Truly [fire emoji}."
    }
  ],
  "publications": [
    {
      "name": "Problems Posed by Ad-blockers",
      "publisher": "Cork Institute of Technology",
      "releaseDate": "2016-10-01",
      "website": "http://robertgabriel.ninja/adblockers.html",
      "summary": "Ad blocking, one of the fastest growing phenomena in internet usage [1], is a type of software that removes or alters advertising content on a web page, most commonly in the form of browser extensions. It allows the user to disable the ad blocker on websites by whitelisting them, which is a list of sites that you want ads to run on. Ad Blocking has existed for the past 15 years, having first become popular on Firefox and then becoming more popular on other systems and browsers such as Googles’ Chrome and Kali Linux."
    },
    {
      "name": "Research into Web Accessibility for Dyslexics",
      "publisher": "Cork Institute of Technology",
      "releaseDate": "2016-10-01",
      "website": "http://robertgabriel.ninja/Research-into-Web-Accessibility-for-Dyslexics-and-Dyslexia-focused-fonts-such-asOpenDyslexia.html",
      "summary": "There are few published papers about usability testing with dyslexia focused fonts, but there is a considerable collection of knowledge on dyslexia as well as many suggestions for authoring dyslexia friendly interfaces. Existing accessibility guidelines for dyslexic and non-dyslexic users suggest that dyslexic-accessible practices may redress difficulties encountered by all Internet users. This paper reviews two existing papers about dyslexia focused fonts (OpenDyslexia font) and accessibility. It will examine the font itself, as well as how the use of the font affects the visual perception, readability, and comprehension of the website and text with general web accessibility. The report is interested in the effects the font has, if any, for people with dyslexia, in comparison with those of Comic Sans or Times New Roman, and on improving human- computer interactions."
    }
  ],
  "skills": [
    {
      "name": "Frontend",
      "level": "",
      "keywords": [
        "HTML",
        "CSS/CSS3",
        "Javascript",
        "Sass",
        "Less",
        "Knockout.js",
        "Angular.js",
        "Bootstrap",
        "Require.js",
        "Node.JS",
        "Coffeescript",
        "Asset Builders (Gulp,Grunt etc)",
        "ES6",
        "Handlebars.js",
        "Firebase.js",
        "Performace"
      ]
    },
    {
      "name": "Backened",
      "level": "",
      "keywords": [
        "Php",
        "Php framworks",
        "Node.js ",
        "Node.js(Framework)",
        "NoSQL",
        "SQl Performance",
        "GOLANG",
        "JAVA",
        "Performace",
        "Object Oriented",
        "Coldfusion",
        "Api design",
        "security",
        "Spring",
        "Database Design "
      ]
    },
    {
      "name": "Other",
      "level": "Git",
      "keywords": [
        "Git",
        "Photoshop",
        "Research Papers"
      ]
    },
    {
      "name": "Design",
      "level": "",
      "keywords": [
        "HCI",
        "Accessibility Design",
        "Ux Design",
        "Usability Testing",
        "User Research",
        "User Interface Design",
        "Information Architecture",
        "interaction Design"
      ]
    }
  ],
  "languages": [
    {
      "language": "English",
      "fluency": "Fluent"
    },
    {
      "language": "Spanish",
      "fluency": "Meh"
    }
  ],
  "interests": [
    {
      "name": "",
      "keywords": [
        "Golf",
        "NFL",
        "Reading",
        "Gym",
        "Hiking",
        "Speaking"
      ]
    },
    {
      "name": "",
      "keywords": []
    }
  ],
  "references": [
    {
      "name": "Robert James Gabriel",
      "reference": "Im great"
    }
  ]
}