{
    "awards": [
        {
            "title": "Forbes 30 Under 30 2020",
            "company": "Forbes",
            "description": "This one still feels surreal! Getting recognized by Forbes for my work on Helperbird was honestly a dream come true. It's incredible to think that something I built to help people like me ended up catching the attention of one of the world's most prestigious business publications."
        },
        {
            "title": "Best Use of Open Source Tools",
            "company": "IBM & Intel",
            "description": "IBM and Intel recognized my innovative use of machine learning algorithms and cutting-edge tools like Node.js and Material Design. It's always exciting when tech giants appreciate your approach to solving problems with the right combination of technologies."
        },
        {
            "title": "Overall Best Poster & Project 2016",
            "company": "Cork Institute of Technology",
            "description": "Cork Institute of Technology gave me top honors for excellence in using machine learning algorithms and advanced tools, including Node.js and Material Design. It felt amazing to have my professors and peers recognize the hard work I'd put into the project."
        },
        {
            "title": "Imagine Cup National Runner-Up 2015",
            "company": "Microsoft Ireland",
            "description": "I entered Microsoft's Imagine Cup with CrossTrainr, an innovative exercise app I designed to connect people with similar fitness interests. The positive feedback from Microsoft employees and management was incredible, and they encouraged me to develop it into a fully functional business. Coming in second place nationally was such a rush!"
        },
        {
            "title": "Imagine Cup National Runner-Up 2014",
            "company": "Microsoft Ireland",
            "description": "The year before, I developed Yeti, a project that resized images and videos to reduce bandwidth and speed up load times. Earning 2nd place in the innovation category for all of Ireland was a huge moment for me – it proved that my ideas could compete on a national level."
        },
        {
            "title": "Hatchery Scholarship for Innovation",
            "company": "Cork Institute of Technology",
            "description": "This scholarship was a game-changer. Over the summer of 2012, I got to develop five student projects into actual businesses. The weekly training workshops and financial assistance were invaluable, and by September, I had completed business plans that I'm still proud of today."
        },
        {
            "title": "Abbott Runner-Up Award",
            "company": "Abbott",
            "description": "For a local SciFest competition, I got creative and built a tablet from an old laptop – added a touch screen panel, programmed a custom interface and apps, and created a completely custom shell. Earning second place and the Abbott award for this DIY project was incredibly satisfying."
        },
        {
            "title": "Most Technically Innovative Award",
            "company": "Cork Institute of Technology",
            "description": "Winning €2,000 for Project Bird was amazing! This was our software studio focused on Windows and web 2.0 developments. Working with my teammate Tadhg Foley and having our technical innovation recognized by CIT was a real confidence boost during our Computing (IT Management) studies."
        },
        {
            "title": "Maths and Algorithms",
            "company": "BT Young Scientist",
            "description": "I earned second place in the Chemical, Physical & Mathematical Sciences Senior Individual category with my project 'A New Algorithm to Improve the Gathering of Information on Mobile.' This project from my time at Scoil Mhuire Gan Smál in Blarney actually became the foundation for what would later become the Yeti engine."
        },
        {
            "title": "Technology 2nd Place",
            "company": "BT Young Scientist Award",
            "description": "As a fifth-year student at Scoil Mhuire Gan Smál in Blarney, I impressed the judges with 'Automated Monitoring of Computer SQL Servers by Way of a Merit.' Little did I know at the time that this project would eventually evolve into Tallus – it's amazing how early ideas can grow into something bigger."
        },
        {
            "title": "SciFest Award for Programming x5",
            "company": "BT Young Scientist Award",
            "description": "SciFest competitions were always intense – one-day science fairs culminating in a national competition. Winning five programming awards was incredible, especially considering these projects had to be completed in just 24 hours. The time pressure really pushed me to think creatively and code efficiently."
        },
        {
            "title": "HEANet Special Award",
            "company": "HEANet",
            "description": "This award recognized my practical and innovative use of network technology for background research and collaboration with team members and teachers. It was great to see that my approach to leveraging networking tools was making a real difference in how we worked together."
        },
        {
            "title": "Avaya Communications Special Award",
            "company": "Avaya",
            "description": "Getting recognized by Avaya, a global leader in business communications and collaboration systems, was a huge honor. They appreciated my innovative approach to networking, unified communications, and video solutions – areas that have always fascinated me."
        },
        {
            "title": "All Ireland Title",
            "company": "Eircom",
            "description": "Winning the All Ireland title from Eircom for creating a fully developed and innovative web application that was both user-friendly and genuinely useful felt incredible. Having your work recognized at a national level is always special, but this one was particularly meaningful."
        },
        {
            "title": "Junior Spider Awards: Best Application",
            "company": "Eircom",
            "description": "Eircom recognized my web application as the best in the Junior Spider Awards category. It was gratifying to know that the emphasis I placed on making it fully developed, user-friendly, and innovative really paid off and resonated with the judges."
        },
        {
            "title": "Teamwork Hackathon 2015: Runner-Up",
            "company": "Teamwork.com",
            "description": "Twenty-four hours, fifteen competing ideas, and somehow my internal social website concept earned second place! The intensity of creating something functional and innovative in such a short timeframe at Teamwork.com was both exhausting and exhilarating."
        },
        {
            "title": "Everyday Excellence Award",
            "company": "Teamwork.com",
            "description": "This recognition from Teamwork.com for my outstanding contributions and impressive work on the website, including potential future updates, meant a lot. It's always wonderful when your day-to-day efforts get acknowledged and appreciated."
        },
        {
            "title": "Above and Beyond the Call of Duty",
            "company": "Teamwork.com",
            "description": "Teamwork.com gave me this award for exceptional work and dedication that went well beyond what was expected. Knowing that I'd impressed the team with innovative website updates and my overall approach was incredibly motivating."
        },
        {
            "title": "The Faculty of Engineering & Science Scholar",
            "company": "Cork Institute of Technology",
            "description": "Receiving the 'Faculty Scholar' accolade for earning the top grade in my class was one of those moments that made all the late nights studying worth it. Having my academic achievements recognized at this level by CIT was incredibly rewarding."
        },
        {
            "title": "Lightning Talk Smackdown Winner",
            "company": "Rebelcon 2017",
            "description": "Winning the Lightning Talk Smackdown at Rebelcon 2017 was such a rush! I presented on creating and converting websites into Progressive Web Apps, complete with a service worker template. The energy in the room and the positive response from the audience was absolutely electric."
        },
        {
            "title": "Google Scholarship Awards",
            "company": "Google.com",
            "description": "Being selected as one of the top 1,000 students worldwide to receive a scholarship for Google's Front-End Web Developer Nanodegree Program was mind-blowing. The fact that Google believed in my potential enough to invest in my education still motivates me every day."
        },
        {
            "title": "Project Cover Grant Winner",
            "company": "Project Cover",
            "description": "Cover is a non-profit that supports driven individuals by extending access to knowledge, networks, and opportunities. Receiving their grant was not just about the financial support – it was validation that what I was working on had the potential to make a real impact."
        },
        {
            "title": "Abe's Curated $100 Micro Grant",
            "company": "Abe's",
            "description": "This $100 micro grant from Abe's was for creating open-source content – CC0, CC-BY, CC-BY-SA, or GPL compatible art, code, and hardware designs. While it might seem small, it was meaningful recognition of my commitment to contributing to the open-source community."
        }
    ]
}