{
    "awards": [
        {
            "title": "Forbes 30 Under 30 2020",
            "company": "Forbes",
            "description": "Still can't quite believe this one. I was named on the Forbes 30 Under 30 list for my work on Helperbird. Something I built to help people like me ended up on Forbes — wild."
        },
        {
            "title": "Best Use of Open Source Tools",
            "company": "IBM & Intel",
            "description": "Won this for a project using machine learning with Node.js and Material Design. IBM and Intel liked the way I put it all together."
        },
        {
            "title": "Overall Best Poster & Project 2016",
            "company": "Cork Institute of Technology",
            "description": "Got top marks at CIT for a project using machine learning, Node.js, and Material Design. Felt great to have the lecturers and classmates recognise the work."
        },
        {
            "title": "Imagine Cup National Runner-Up 2015",
            "company": "Microsoft Ireland",
            "description": "Entered Microsoft's Imagine Cup with CrossTrainr, a fitness app that connected people with similar workout interests. Came second nationally and the Microsoft team encouraged me to take it further."
        },
        {
            "title": "Imagine Cup National Runner-Up 2014",
            "company": "Microsoft Ireland",
            "description": "Built Yeti, a tool that resized images and videos to cut bandwidth and speed up load times. Got 2nd place in the innovation category for Ireland. This one later grew into a bigger project."
        },
        {
            "title": "Hatchery Scholarship for Innovation",
            "company": "Cork Institute of Technology",
            "description": "Got a scholarship over the summer of 2012 to turn five student projects into real businesses. Weekly workshops, proper mentorship, and by September I had actual business plans done."
        },
        {
            "title": "Abbott Runner-Up Award",
            "company": "Abbott",
            "description": "For a SciFest competition, I built a tablet from an old laptop — added a touch screen, coded a custom interface and apps, and made a completely custom shell. Got second place and the Abbott award."
        },
        {
            "title": "Most Technically Innovative Award",
            "company": "Cork Institute of Technology",
            "description": "Won €2,000 for Project Bird, a software studio I ran with my mate Tadhg Foley focused on Windows and web 2.0 projects. Nice to get that recognised during college."
        },
        {
            "title": "Maths and Algorithms",
            "company": "BT Young Scientist",
            "description": "Second place in the Chemical, Physical & Mathematical Sciences category for 'A New Algorithm to Improve the Gathering of Information on Mobile.' This project ended up being the early version of what became the Yeti engine."
        },
        {
            "title": "Technology 2nd Place",
            "company": "BT Young Scientist Award",
            "description": "In fifth year, I built 'Automated Monitoring of Computer SQL Servers by Way of a Merit.' Didn't know it at the time, but it eventually grew into Tallus."
        },
        {
            "title": "SciFest Award for Programming x5",
            "company": "BT Young Scientist Award",
            "description": "Won five programming awards at SciFest — one-day science fairs where you build everything in 24 hours. The time pressure was intense but it taught me to code fast and think on my feet."
        },
        {
            "title": "HEANet Special Award",
            "company": "HEANet",
            "description": "Recognised for how I used networking tools for research and collaboration. Basically got an award for being handy with the internet."
        },
        {
            "title": "Avaya Communications Special Award",
            "company": "Avaya",
            "description": "Got recognised by Avaya for my work with networking and communication tools. Was chuffed that a company that big noticed what I was doing."
        },
        {
            "title": "All Ireland Title",
            "company": "Eircom",
            "description": "Won the All Ireland title from Eircom for building a web app that the judges thought was well-made and genuinely useful. This one meant a lot."
        },
        {
            "title": "Junior Spider Awards: Best Application",
            "company": "Eircom",
            "description": "Best application in the Junior Spider Awards. I'd put a lot of effort into making it properly polished, so it was great to see that pay off."
        },
        {
            "title": "Teamwork Hackathon 2015: Runner-Up",
            "company": "Teamwork.com",
            "description": "24 hours, 15 competing ideas. Built an internal social website concept and came second. Knackered but happy."
        },
        {
            "title": "Everyday Excellence Award",
            "company": "Teamwork.com",
            "description": "Got this at Teamwork for consistently doing good work on the website. Always nice when the day-to-day stuff gets noticed."
        },
        {
            "title": "Above and Beyond the Call of Duty",
            "company": "Teamwork.com",
            "description": "Teamwork gave me this for going above and beyond on the website. Apparently I was doing more than they expected — I just liked the work."
        },
        {
            "title": "The Faculty of Engineering & Science Scholar",
            "company": "Cork Institute of Technology",
            "description": "Got the Faculty Scholar title for having the top grade in my class at CIT. Made all those late nights studying feel worth it."
        },
        {
            "title": "Lightning Talk Smackdown Winner",
            "company": "Rebelcon 2017",
            "description": "Won the Lightning Talk Smackdown at Rebelcon 2017. Talked about converting websites to Progressive Web Apps and shared a service worker template. The crowd was well up for it."
        },
        {
            "title": "Google Scholarship Awards",
            "company": "Google.com",
            "description": "Selected as one of 1,000 students worldwide for a Google scholarship covering their Front-End Web Developer Nanodegree. Pretty surreal getting that email."
        },
        {
            "title": "Project Cover Grant Winner",
            "company": "Project Cover",
            "description": "Cover is a non-profit that helps people get access to opportunities and networks. Getting their grant felt like proper validation that what I was building could actually help people."
        },
        {
            "title": "Abe's Curated $100 Micro Grant",
            "company": "Abe's",
            "description": "A small grant from Abe's for creating open-source content — CC0, CC-BY, and GPL compatible stuff. Only $100 but it was cool to get recognised for contributing to open source."
        }
    ]
}
