{
    "awards": [
        {
            "title": "Forbes 30 Under 30 2020",
            "company": "Forbes",
            "description": "Awarded for my work on creating and developing Helperbird."
        },
        {
            "title": "Best Use of Open Source Tools",
            "company": "IBM & Intel",
            "description": "Awarded for innovative use of machine learning algorithms and cutting-edge tools such as Node.js and Material Design."
        },
        {
            "title": "Overall Best Poster & Project 2016",
            "company": "Cork Institute of Technology",
            "description": "Recognized for excellence in using machine learning algorithms and advanced tools, including Node.js and Material Design."
        },
        {
            "title": "Imagine Cup National Runner-Up 2015",
            "company": "Microsoft Ireland",
            "description": "Entered the Imagine Cup with an innovative exercise app called CrossTrainr, designed to connect individuals with similar exercise interests. The app received positive feedback from Microsoft employees and management, encouraging further development into a fully functional business."
        },
        {
            "title": "Imagine Cup National Runner-Up 2014",
            "company": "Microsoft Ireland",
            "description": "Developed a project called Yeti, which resized images and videos to reduce bandwidth and speed up load times. This project earned 2nd place in the innovation category for all of Ireland."
        },
        {
            "title": "Hatchery Scholarship for Innovation",
            "company": "Cork Institute of Technology",
            "description": "Developed five student projects into businesses over the summer of 2012. Attended weekly training workshops and received financial assistance, resulting in completed business plans by September."
        },
        {
            "title": "Abbott Runner-Up Award",
            "company": "Abbott",
            "description": "For a local competition called SciFest, built a tablet from an old laptop, added a touch screen panel, programmed an interface and apps, and created a custom shell. This project earned second place and the Abbott award."
        },
        {
            "title": "Most Technically Innovative Award",
            "company": "Cork Institute of Technology",
            "description": "Awarded €2,000 for Project Bird, a software studio focusing on Windows and web 2.0 developments. The team included Robert Gabriel and Tadhg Foley, both students in Computing (IT Management) at CIT."
        },
        {
            "title": "Maths and Algorithms",
            "company": "BT Young Scientist",
            "description": "Robert Gabriel from Scoil Mhuire Gan Smál in Blarney earned second place in the Chemical, Physical & Mathematical Sciences Senior Individual category for his project 'A New Algorithm to Improve the Gathering of Information on Mobile,' which later became the Yeti engine."
        },
        {
            "title": "Technology 2nd Place",
            "company": "BT Young Scientist Award",
            "description": "Robert Gabriel, a fifth-year student from Scoil Mhuire Gan Smál in Blarney, impressed the judges with his project 'Automated Monitoring of Computer SQL Servers by Way of a Merit,' which later became Tallus."
        },
        {
            "title": "SciFest Award for Programming x5",
            "company": "BT Young Scientist Award",
            "description": "SciFest is a series of one-day science fairs for second-level students, culminating in a national competition. This project, completed in 24 hours, won recognition for its innovative programming."
        },
        {
            "title": "HEANet Special Award",
            "company": "HEANet",
            "description": "Awarded for the most practical and innovative use of network technology in performing background research and collaborating with team members and teachers."
        },
        {
            "title": "Avaya Communications Special Award",
            "company": "Avaya",
            "description": "Recognized by Avaya, a global provider of business communications and collaboration systems, for innovative solutions in networking, unified communications, and video products."
        },
        {
            "title": "All Ireland Title",
            "company": "Eircom",
            "description": "Awarded for a fully developed and innovative web application that is user-friendly and useful."
        },
        {
            "title": "Junior Spider Awards: Best Application",
            "company": "Eircom",
            "description": "Recognized for a fully developed, user-friendly, and innovative web application."
        },
        {
            "title": "Teamwork Hackathon 2015: Runner-Up",
            "company": "Teamwork.com",
            "description": "Created an internal social website in 24 hours, earning second place among 15 ideas."
        },
        {
            "title": "Everyday Excellence Award",
            "company": "Teamwork.com",
            "description": "Recognized for outstanding contributions and impressive work on the website, including potential future updates."
        },
        {
            "title": "Above and Beyond the Call of Duty",
            "company": "Teamwork.com",
            "description": "Awarded for exceptional work and dedication, impressing the team with innovative website updates."
        },
        {
            "title": "The Faculty of Engineering & Science Scholar",
            "company": "Cork Institute of Technology",
            "description": "Received the accolade 'Faculty Scholar' for earning the top grade in my class."
        },
        {
            "title": "Lightning Talk Smackdown Winner",
            "company": "Rebelcon 2017",
            "description": "Presented a talk on creating or converting websites/web apps into Progressive Web Apps, including a service worker template."
        },
        {
            "title": "Google Scholarship Awards",
            "company": "Google.com",
            "description": "Selected as one of the top 1,000 students to receive scholarships for the Front-End Web Developer Nanodegree Program."
        },
        {
            "title": "Project Cover Grant Winner",
            "company": "Project Cover",
            "description": "Awarded a grant by Cover, a non-profit organization that supports driven individuals by extending access to knowledge, networks, and opportunities."
        },
        {
            "title": "Abe's Curated $100 Micro Grant",
            "company": "Abe's",
            "description": "Received a $100 grant for creating CC0, CC-BY, CC-BY-SA, or GPL (compatible) art, code, hardware designs, and more."
        }
    ]
}
